; domain
(define (domain pour-liquid-domain)

  (:requirements :typing :negative-preconditions)

  (:types
    location
    object
    container - object
  )

  (:predicates
    (robot-at ?loc - location)
    (object-at ?obj - object ?loc - location)
    (holding ?obj - object)
    (gripper-empty)
    (has-liquid ?c - container)
    (tilted ?obj - object)
  )

  ;; ---------------------------------------------------------
  ;; Move the robot symbolically between two locations
  ;; ---------------------------------------------------------
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and
      (robot-at ?from)
    )
    :effect (and
      (not (robot-at ?from))
      (robot-at ?to)
    )
  )

  ;; ---------------------------------------------------------
  ;; Grasp an object that is at the robot's current location
  ;; ---------------------------------------------------------
  (:action grasp
    :parameters (?obj - object ?loc - location)
    :precondition (and
      (robot-at ?loc)
      (object-at ?obj ?loc)
      (gripper-empty)
    )
    :effect (and
      (holding ?obj)
      (not (gripper-empty))
      (not (object-at ?obj ?loc))
    )
  )

  ;; ---------------------------------------------------------
  ;; Tilt a held object in preparation for pouring
  ;; ---------------------------------------------------------
  (:action tilt
    :parameters (?obj - object)
    :precondition (and
      (holding ?obj)
      (not (tilted ?obj))
    )
    :effect (and
      (tilted ?obj)
    )
  )

  ;; ---------------------------------------------------------
  ;; Pour liquid from a held, tilted container into a
  ;; target container located at the robot's current location
  ;; ---------------------------------------------------------
  (:action pour
    :parameters (?source - container ?target - container ?loc - location)
    :precondition (and
      (holding ?source)
      (tilted ?source)
      (robot-at ?loc)
      (object-at ?target ?loc)
      (has-liquid ?source)
      (not (has-liquid ?target))
    )
    :effect (and
      (not (has-liquid ?source))
      (has-liquid ?target)
    )
  )

  ;; ---------------------------------------------------------
  ;; Rotate a held object back to an upright orientation
  ;; ---------------------------------------------------------
  (:action rotate
    :parameters (?obj - object)
    :precondition (and
      (holding ?obj)
      (tilted ?obj)
    )
    :effect (and
      (not (tilted ?obj))
    )
  )

  ;; ---------------------------------------------------------
  ;; Place a held, upright object down at the current location
  ;; ---------------------------------------------------------
  (:action place
    :parameters (?obj - object ?loc - location)
    :precondition (and
      (holding ?obj)
      (robot-at ?loc)
      (not (tilted ?obj))
    )
    :effect (and
      (object-at ?obj ?loc)
      (gripper-empty)
      (not (holding ?obj))
    )
  )

)

; problem
(define (problem pour-bottle-into-mug)
  (:domain pour-liquid-domain)

  (:objects
    bottle mug   - container
    start_loc bottle_loc mug_loc - location
  )

  (:init
    (robot-at start_loc)
    (object-at bottle bottle_loc)
    (object-at mug mug_loc)
    (gripper-empty)
    (has-liquid bottle)
    ;; mug has no liquid (absence of has-liquid mug)
    ;; bottle is not tilted (absence of tilted bottle)
  )

  (:goal
    (and
      (object-at bottle bottle_loc)
      (has-liquid mug)
      (gripper-empty)
      (not (has-liquid bottle))
    )
  )
)

; plan
1. (move start_loc bottle_loc)
   deleted: (robot-at start_loc)
   added: (robot-at bottle_loc)
   goals met: 2 of 4
2. (grasp bottle bottle_loc)
   deleted: (gripper-empty) (object-at bottle bottle_loc)
   added: (holding bottle)
   goals met: 0 of 4
3. (move bottle_loc mug_loc)
   deleted: (robot-at bottle_loc)
   added: (robot-at mug_loc)
   goals met: 0 of 4
4. (tilt bottle)
   added: (tilted bottle)
   goals met: 0 of 4
5. (pour bottle mug mug_loc)
   deleted: (has-liquid bottle)
   added: (has-liquid mug)
   goals met: 2 of 4
6. (rotate bottle)
   deleted: (tilted bottle)
   goals met: 2 of 4
7. (move mug_loc bottle_loc)
   deleted: (robot-at mug_loc)
   added: (robot-at bottle_loc)
   goals met: 2 of 4
8. (place bottle bottle_loc)
   deleted: (holding bottle)
   added: (object-at bottle bottle_loc) (gripper-empty)
   goals met: 4 of 4
